/*
Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное само на себя).
Например:
4 -> 16
-3 -> 9
-7 -> 49
*/


int UserNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(UserNumber);